# specify a directory to install
cask_args appdir: '/Applications'

# install packages
brew 'git'
brew 'bash-completion'
brew 'ag'
brew 'tree'
brew 'pgcli'
brew 'heroku'

brew 'coreutils'
brew 'binutils'
brew 'diffutils'
brew 'ed', args: ["with-default-names"]
brew 'findutils', args: ["with-default-names"]
brew 'grep', args: ["with-default-names"]
brew 'gzip'
brew 'gnu-sed', args: ["with-default-names"]
brew 'gnu-tar', args: ["with-default-names"]
brew 'wget'
brew 'mas'
brew 'jq'

# casks
tap 'caskroom/homebrew-cask' || true
cask 'google-chrome'
cask 'dropbox'
cask '1password'
cask '1password-cli'
cask 'iterm2'
cask 'slack'
cask 'docker'
cask 'skype'
cask 'visual-studio-code'
cask 'java'
cask 'datagrip'
cask 'teamviewer'
cask 'docker'

# mac app store apps
mas 'Microsoft Remote Desktop 10', id: 1295203466

# neovim
tap 'neovim/neovim' || true
brew 'neovim'

tap 'd12frosted/emacs-plus'
brew 'emacs-plus'

